import { ref } from 'vue';

const genreList = ref([
  { genreName: '語学・学習参考書',
    genreId: '001002',
    subGenres: [
      { name: '語学学習', id: '001002001'},
      { name: '語学辞書', id: '001002002'},
      { name: '辞典', id: '001002003'},
      { name: '語学関係資格', id: '001002005'},
      { name: '学習参考書・問題集', id: '001002006'},
      { name: '図鑑・資料集', id: '001002008'},
      { name: 'その他', id: '001002007'}
    ]
  },
  { genreName: '科学・技術',
    genreId: '001012',
    subGenres: [
      { name: '自然科学全般', id: '001012001'},
      { name: '数学', id: '001012002'},
      { name: '物理学', id: '001012003'},
      { name: '化学', id: '001012004'},
      { name: '地学・天文学', id: '001012005'},
      { name: '生物学', id: '001012006'},
      { name: '植物学', id: '001012007'},
      { name: '動物学', id: '001012008'},
      { name: '工学', id: '001012010'},
      { name: '建築学', id: '001012011'},
      { name: 'その他', id: '001012016'}
    ]
  },
  { genreName: '医学・薬学・看護学・歯科学',
    genreId: '001028',
    subGenres: [
      { name: '基礎医学', id: '001028001'},
      { name: '臨床医学一般', id: '001028002'},
      { name: '臨床医学内科系', id: '001028003'},
      { name: '臨床医学外科系', id: '001028004'},
      { name: '臨床医学専門科別', id: '001028005'},
      { name: '医学一般・社会医学', id: '001028006'},
      { name: '基礎看護学', id: '001028007'},
      { name: '臨床成人看護', id: '001028008'},
      { name: '臨床看護専門科別', id: '001028009'},
      { name: '臨床看護一般', id: '001028010'},
      { name: '看護学生向け', id: '001028011'},
      { name: '保健・助産', id: '001028012'},
      { name: '医療関連科学・技術', id: '001028013'},
      { name: '伝統医学・東洋医学', id: '001028014'},
      { name: '薬学', id: '001028015'},
      { name: '歯科医学', id: '001028016'},
      { name: '試験対策(資格試験別)', id: '001028017'},
      { name: '辞事典・白書・語学', id: '001028018'},
      { name: 'その他', id: '001028019'},
    ]
  },
  { genreName: '資格・検定',
    genreId: '001016',
    subGenres: [
      { name: '看護・医療関係資格', id: '001016001'},
      { name: '法律関係資格', id: '001016002'},
      { name: 'ビジネス関係資格', id: '001016003'},
      { name: '宅建・不動産関係資格', id: '001016004'},
      { name: '食品・調理関係資格', id: '001016005'},
      { name: '教育・心理関係資格', id: '001016006'},
      { name: 'インテリア関係資格', id: '001016007'},
      { name: '介護・福祉関係資格', id: '001016008'},
      { name: '技術・建築関係資格', id: '001016009'},
      { name: '語学関係資格', id: '001016010'},
      { name: 'パソコン関係資格', id: '001016011'},
      { name: '旅行主任者', id: '001016012'},
      { name: 'カラーコーディネーター・色彩検定', id: '001016013'},
      { name: '数学検定', id: '001016014'},
      { name: '公務員試験', id: '001016015'},
      { name: '自動車免許', id: '001016016'},
      { name: 'その他', id: '001016017'},
    ]
  },
  { genreName: 'パソコン・システム開発',
    genreId: '001005',
    subGenres: [
      { name: 'ハードウェア', id: '001005001'},
      { name: '入門書', id: '001005002'},
      { name: 'インターネット・WEBデザイン', id: '001005003'},
      { name: 'ネットワーク', id: '001005004'},
      { name: 'プログラミング', id: '001005005'},
      { name: 'アプリケーション', id: '001005006'},
      { name: 'OS', id: '001005007'},
      { name: 'デザイン・グラフィックス', id: '001005008'},
      { name: 'ITパスポート', id: '001005009'},
      { name: 'MOUS・MOT', id: '001005010'},
      { name: 'パソコン検定', id: '001005011'},
      { name: 'IT・eコマース', id: '001005013'},
      { name: 'その他', id: '001005017'},
    ]
  }
])

const useGrenreList = () => {
  return { genreList }
}

export default useGrenreList